#Game Over - версия 2.0
#Показывает разные приемы работы со строками

print("Программа 'Game Over' ver. 2.0")
print("То же", "самое", "сообщение.")
print("Тлько",
      "чуть-чуть",
      "побольше.")
print("Вот", end=" ")
print("оно...")

print("""
    ______       ___       ___  ___   _____
   / _____|     /   |     /   |/   | |  ___|
   | |         / /| |    / /|   /| | | |___
   | |   _    / ___ |   / / |__/ | | |  ___|
   | |__| |  / /  | |  / /       | | | |___
   \______/ /_/   |_| /_/        |_| |_____|
    _____   _     _   _____   _____
   /  _  \ | |   / / |  ___| |  _  \ 
   | | | | | |  / /  | |___  | |_| |
   | | | | | | / /   |  ___| |  _  /
   | |_| | | |/ /    | |___  | | \ \ 
   \_____/ |___/     |_____| |_|  \_\ 
       
      """)

input("\n\nНажмите Enter, чтобы выйти")
