# Текстовые задачи
# Демонстрирует математические операции

print("\nЕсли беременная самка бегемота массой 800 кг родит детеныша массой 40 кг,")
print("но затем съест 20 кг корма, то сколько она будет после всего этого весить?")
input("Чтобы узнать нажмите Enter.")
print("800 - 40 + 20 =", 800 - 40 + 20, "кг.")

print("\nЕсли студент, возвращаясь с успешно сданного экзамена, на радостях")
print("купил каждому из 6 друзей по 3 бутылки пива, то сколько всего бутылок пиво куплено друзьям?")
input("Чтобы узнать нажмите Enter.")
print("6 * 3 =", 6 * 3, "шт.")

print("\nЕсли в ресторане вам сприятелями принесли счет на 19 долларов (считая чаевые),")
print("и вы решили скинуться поровну на четверых, то сколько придется с каждого?")
input("Чтобы узнать нажмите Enter.")
print("19 / 4 =", 19 / 4, "$")

print("\nУсли четверо пиратов найдут ларчик, в котором ровно 107 золотых монет, и")
print("решат разделить добычу поровну, то сколько целых мионет достанется каждому?")
input("Чтобы узнать нажмите Enter.")
print("107 // 4 =", 107 // 4, "шт.")

print("\nЕсли те же самые четверо пиратов разделят те же 107 монет из ларчика поровну,")
print("то сколько останется ничейных монет?")
input("Чтобы узнать нажмите Enter.")
print("107 % 4 =", 107 % 4, "шт.")

print("\n\nНажмите Enter, чтобы выйти.")
